{
  "amazon": "Amazon is a global e-commerce platform offering a wide range of products.",
  "alibaba": "Alibaba is a Chinese e-commerce giant providing online retail and wholesale services.",
  "jd": "JD.com (Jingdong) is a Chinese online retailer specializing in electronics and general merchandise.",
  "taobao": "Taobao is a Chinese online shopping platform owned by Alibaba Group.",
  "meituan": "Meituan is a Chinese platform focused on food delivery and lifestyle services.",
  "didi": "Didi is a Chinese ride-hailing and transportation service provider.",
  "eleme": "Eleme is a Chinese food delivery platform owned by Alibaba Group.",
  "pinduoduo": "Pinduoduo is a Chinese e-commerce platform offering group buying deals.",
  "wechat": "WeChat (Weixin) is a Chinese social media and payment app developed by Tencent.",
  "alipay": "Alipay is a mobile and online payment platform developed by Ant Group.",
  "xiaomi": "Xiaomi is a Chinese electronics company known for smartphones and smart devices.",
  "huawei": "Huawei is a Chinese technology company specializing in telecommunications equipment and smartphones.",
  "apple": "Apple is an American technology company known for iPhones, iPads, and Mac computers.",
  "microsoft": "Microsoft is an American multinational technology corporation producing software and electronics.",
  "starbucks": "Starbucks is an American coffeehouse chain known for coffee and beverages.",
  "kfc": "KFC (Kentucky Fried Chicken) is an American fast-food restaurant chain specializing in fried chicken.",
  "nike": "Nike is an American multinational corporation engaged in the design and manufacturing of footwear and apparel.",
  "adidas": "Adidas is a German multinational company designing and manufacturing shoes, clothing, and accessories.",
  "uniqlo": "Uniqlo is a Japanese casual wear designer, manufacturer, and retailer.",
  "zara": "Zara is a Spanish apparel retailer specializing in fast fashion.",
  "didichuxing": "Didi Chuxing is a major Chinese ride-hailing service company.",
  "meituan": "Meituan is a leading Chinese platform for food delivery, hotel booking, and other services.",
  "eleme": "Eleme is a major food delivery service platform in China.",
  "jd": "JD.com (Jingdong) is one of China's largest online retailers.",
  "taobao": "Taobao is a popular Chinese online shopping platform owned by Alibaba.",
  "pinduoduo": "Pinduoduo is a Chinese online platform specializing in social group buying deals.",
  "alipay": "Alipay is a leading Chinese digital payment platform operated by Ant Group.",
  "wechatpay": "WeChat Pay is a digital wallet service integrated into WeChat.",
  "xiaomi": "Xiaomi is a Chinese electronics brand offering smartphones and smart home devices.",
  "huawei": "Huawei is a Chinese multinational technology company providing telecom equipment and smartphones."
}